### 데이터 선택(loc 활용)
- 이름을 이용하여 원하는 데이터 선택
- 데이터명.loc[조회할 행 index , 조회할 컬럼명]

In [1]:
data = {
    '이름' : ['김자바', '이자바', '박자바', '최캐드', '정캐드']
    , '학급' : ['자바반', '자바반', '자바반', '캐드반', '캐드반']
    , '국어점수' : [90, 80, 70, 100, 90]
    , '영어점수' : [70, 80, 80, 70, 90]
    , '평균' : [80.0, 80.0, 75.0, 85.0, 90.0]
    , '취미' : ['독서', '', '', '요가', '축구']
}

In [4]:
import pandas as pd
df = pd.DataFrame(data)
df

    이름   학급  국어점수  영어점수    평균  취미
0  김자바  자바반    90    70  80.0  독서
1  이자바  자바반    80    80  80.0
2  박자바  자바반    70    80  75.0
3  최캐드  캐드반   100    70  85.0  요가
4  정캐드  캐드반    90    90  90.0  축구

In [7]:
# 만들어진 DataFrame에 index를 추가
df.index = ['1번', '2번', '3번', '4번', '5번']
df

     이름   학급  국어점수  영어점수    평균  취미
1번  김자바  자바반    90    70  80.0  독서
2번  이자바  자바반    80    80  80.0
3번  박자바  자바반    70    80  75.0
4번  최캐드  캐드반   100    70  85.0  요가
5번  정캐드  캐드반    90    90  90.0  축구

In [11]:
# 특정 컬럼값 조회 (세로 조회)
df['이름']
df[['이름','학급']]

#특정 행 데이터 조회 (가로 조회)
df.loc['1번']
df.loc[['1번', '2번']]

     이름   학급  국어점수  영어점수    평균  취미
1번  김자바  자바반    90    70  80.0  독서
2번  이자바  자바반    80    80  80.0

In [13]:
# 특정 행과 특정 컬럼 데이터 조회
df.loc[['1번', '2번'], '이름']
df.loc[['1번', '2번'], ['국어점수', '영어점수', '평균']]

    국어점수  영어점수    평균
1번    90    70  80.0
2번    80    80  80.0

In [20]:
# 특정 행과 특정 컬럼 데이터 조회 (2) : 슬라이싱
df.loc['1번':'3번', '이름':'영어점수']

     이름   학급  국어점수  영어점수
1번  김자바  자바반    90    70
2번  이자바  자바반    80    80
3번  박자바  자바반    70    80

### 데이터 선택(iloc 활용) index loc
- 데이터의 위치를 활용하여 특정 데이터 조회

In [25]:
df.iloc[0] # 0번째 데이터 조회

이름       김자바
학급       자바반
국어점수      90
영어점수      70
평균      80.0
취미        독서
Name: 1번, dtype: object

In [29]:
# 이름이 김자바, 박자바인 학생들의 데이터만 조회
df.iloc[[0, 2]]

     이름   학급  국어점수  영어점수    평균  취미
1번  김자바  자바반    90    70  80.0  독서
3번  박자바  자바반    70    80  75.0

In [30]:
df.iloc[0:4]

     이름   학급  국어점수  영어점수    평균  취미
1번  김자바  자바반    90    70  80.0  독서
2번  이자바  자바반    80    80  80.0
3번  박자바  자바반    70    80  75.0
4번  최캐드  캐드반   100    70  85.0  요가

In [33]:
df.iloc[1:4, 1:4]

     학급  국어점수  영어점수
2번  자바반    80    80
3번  자바반    70    80
4번  캐드반   100    70

In [35]:
df.iloc[[1,3,4],[0,1,3]]

     이름   학급  영어점수
2번  이자바  자바반    80
4번  최캐드  캐드반    70
5번  정캐드  캐드반    90